-- 서울
INSERT INTO sub_region (region_id, sigungu_code, sigungu_name)
VALUES (1, '1', '강남구'),
       (1, '2', '강동구'),
       (1, '3', '강북구'),
       (1, '4', '강서구'),
       (1, '5', '관악구'),
       (1, '6', '광진구'),
       (1, '7', '구로구'),
       (1, '8', '금천구'),
       (1, '9', '노원구'),
       (1, '10', '도봉구'),
       (1, '11', '동대문구'),
       (1, '12', '동작구'),
       (1, '13', '마포구'),
       (1, '14', '서대문구'),
       (1, '15', '서초구'),
       (1, '16', '성동구'),
       (1, '17', '성북구'),
       (1, '18', '송파구'),
       (1, '19', '양천구'),
       (1, '20', '영등포구'),
       (1, '21', '용산구'),
       (1, '22', '은평구'),
       (1, '23', '종로구'),
       (1, '24', '중구'),
       (1, '25', '중랑구');

-- 인천
INSERT INTO sub_region (region_id, sigungu_code, sigungu_name)
VALUES (2, '1', '강화군'),
       (2, '2', '계양구'),
       (2, '3', '미추홀구'),
       (2, '4', '남동구'),
       (2, '5', '동구'),
       (2, '6', '부평구'),
       (2, '7', '서구'),
       (2, '8', '연수구'),
       (2, '9', '옹진군'),
       (2, '10', '중구');

-- 대전
INSERT INTO sub_region (region_id, sigungu_code, sigungu_name)
VALUES (3, '1', '대덕구'),
       (3, '2', '동구'),
       (3, '3', '서구'),
       (3, '4', '유성구'),
       (3, '5', '중구');

-- 대구
INSERT INTO sub_region (region_id, sigungu_code, sigungu_name)
VALUES (4, '1', '남구'),
       (4, '2', '달서구'),
       (4, '3', '달성군'),
       (4, '4', '동구'),
       (4, '5', '북구'),
       (4, '6', '서구'),
       (4, '7', '수성구'),
       (4, '8', '중구'),
       (4, '9', '군위군');

-- 광주
INSERT INTO sub_region (region_id, sigungu_code, sigungu_name)
VALUES (5, '1', '광산구'),
       (5, '2', '남구'),
       (5, '3', '동구'),
       (5, '4', '북구'),
       (5, '5', '서구');

-- 부산
INSERT INTO sub_region (region_id, sigungu_code, sigungu_name)
VALUES (6, '1', '강서구'),
       (6, '2', '금정구'),
       (6, '3', '기장군'),
       (6, '4', '남구'),
       (6, '5', '동구'),
       (6, '6', '동래구'),
       (6, '7', '부산진구'),
       (6, '8', '북구'),
       (6, '9', '사상구'),
       (6, '10', '사하구'),
       (6, '11', '서구'),
       (6, '12', '수영구'),
       (6, '13', '연제구'),
       (6, '14', '영도구'),
       (6, '15', '중구'),
       (6, '16', '해운대구');
